backend/app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes"
---
  def index
    incomes = Income.all