backend/app/controllers/shifts_controller.rb

SELECT "shifts".* FROM "shifts"
---
  def index
    shifts = Shift.all