backend/app/controllers/workplaces_controller.rb

  def index
    workplaces = Workplace.all
---
SELECT "workplaces".* FROM "workplaces"